bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/StdDriver/Src/bl702_nflash.c
/**
  ******************************************************************************
  * @file    bl702_sflash.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "string.h"
#include "bl702_sflash.h"
#include "bl702_sf_ctrl.h"
#include "bl702_nf_cfg.h"
#include "bl702_nflash.h"
#include "bl702_l1c.h"

#define SFCTRL_BUSY_STATE_TIMEOUT               (5 * 160 * 1000)
Nand_Flash_Cfg_Type flashCfg;

/*
ECCS provides ECC status as follows:[2:5]
0000b = No bit errors were detected during the previous read algorithm.
0001b = 1 bit error was detected and corrected.
0010b = 2 bit error was detected and corrected.
0011b = 3 bit error was detected and corrected.
0100b = 4 bit error was detected and corrected.
0101b = 5 bit error was detected and corrected.
0110b = 6 bit error was detected and corrected.
0111b = 7 bit error was detected and corrected.
1000b = bit error was detected and not corrected.
1100b = 8bit errors were detected and corrected,
*/
/*
BL_Nand_Flash_Program_Bit_Err_Type ATTR_TCM_SECTION NFlash_Pass(uint8_t errorCode, BL_Nand_Flash_OP_Type opType)
{
	if (opType == ERASE){
		if ((errorCode & 0x04) == 4)
			return E_FAIL;
	}
	else if (opType == READ){
		if ((errorCode & 0x04) == 4)
			return P_FAIL;
	}
	else if (opType == PROGRAM){
		if ((errorCode & 0x3C) == 0x0)
			return NO_BIT;
		else if ((errorCode & 0x3C) == 0x04)
			return ONE_BIT;
		else if ((errorCode & 0x3C) == 0x08)
			return TWO_BIT;
		else if ((errorCode & 0x3C) == 0x0C)
			return THREE_BIT;
		else if ((errorCode & 0x3C) == 0x10)
			return FOUR_BIT;
		else if ((errorCode & 0x3C) == 0x14)
			return FIVE_BIT;
		else if ((errorCode & 0x3C) == 0x18)
			return SIX_BIT;
		else if ((errorCode & 0x3C) == 0x1C)
			return SEVEN_BIT;
		else if ((errorCode & 0x3C) == 0x20)
			return BIT;
		else if ((errorCode & 0x3C) == 0x30)
			return EIGHT_BIT;
	}

	return PROGRAM_OK;
}
*/
DSTATUS ff_disk_initialize (BYTE pdrv)
{
	NF_Cfg_Flash_Identify(0, 1, 0, 0, &flashCfg);
	return RES_OK;
}
DRESULT ff_disk_read(BYTE pdrv, BYTE *buff, DWORD sector, UINT count)
{
	//512 bytes in a sector
	uint32_t startaddr = sector * DISK_SECTOR_SIZE;
	uint32_t len = count * DISK_SECTOR_SIZE;
	uint32_t i = 0, curLen = 0;
	Nand_Flash_Cfg_Type flashCfg;
	for(i = 0; i < len;){
		curLen = len - i;
		if(curLen >= FLASH_CTRL_BUF_SIZE){
			curLen = FLASH_CTRL_BUF_SIZE;
		}
		if(NFlash_Read(&flashCfg, startaddr, buff,  curLen) != SUCCESS){
			return RES_ERROR;
		}
		i += curLen;
		buff += curLen;
	}
	return RES_OK;
}
DRESULT ff_disk_write(BYTE pdrv, const BYTE *buff, DWORD sector, UINT count)
{
	//512 bytes in a sector
	uint32_t startaddr = sector * DISK_SECTOR_SIZE;
	uint32_t len = count * DISK_SECTOR_SIZE;
	uint32_t i = 0, curLen = 0;
	Nand_Flash_Cfg_Type flashCfg;
	for (i = 0; i < len;){
		curLen = len - i;
		if(curLen >= FLASH_CTRL_BUF_SIZE){
			curLen = FLASH_CTRL_BUF_SIZE;
		}
		if (NFlash_Program(&flashCfg, startaddr, buff, curLen) != SUCCESS){
			return RES_ERROR;
		}
		i += curLen;
		buff += curLen;
	}
	return RES_OK;
}
/****************************************************************************//**
 * @brief  Get flash jedec ID
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  data: data pointer to store read data
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_GetJedecId(Nand_Flash_Cfg_Type *flashCfg, uint8_t *data)
{
    uint8_t * const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint8_t cmd = 0x9F, dummyClks = 1;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint32_t timeOut = 0;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    flashCmd.cmdBuf[0] = (cmd << 24);
    flashCmd.rwFlag = SF_CTRL_READ;
    /* make dummy bytes zero*/
    flashCmd.addrSize = dummyClks;
    flashCmd.nbData = 2;

    SF_Ctrl_SendCmd(&flashCmd);
    timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

    BL702_MemCpy(data, flashCtrlBuf, flashCmd.nbData);

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Erase flash
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  startaddr: start address to erase
 * @param  endaddr: end address(include this address) to erase
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Erase(Nand_Flash_Cfg_Type *flashCfg, uint32_t startAddr, uint32_t endAddr)
{
	uint32_t blockNum = 0;
    uint32_t startBlockNum = 0, endBlockNum = 0;
    uint8_t getFeatureData = 0;

    startBlockNum = startAddr / BFLB_NAND_FLASH_BLK_DATA_SIZE;
    endBlockNum = endAddr / BFLB_NAND_FLASH_BLK_DATA_SIZE;

