bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/StdDriver/Src/bl702_nflash.c
    if (startAddr <= endAddr){
    	for (blockNum = startBlockNum; blockNum <= endBlockNum; blockNum++){
    		//NFlash_Set_Feature(flashCfg);
    		if (flashCfg->blk128EraseCmd != BFLB_NAND_FLASH_CMD_INVALID){
				NFlash_Write_Enable(flashCfg);
				NFlash_Blk128_Erase(flashCfg, blockNum);
				NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
				// bit[0]:operation in process
				while ((getFeatureData & 1) == 1){
					NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
				}
				// bit[2]:erase fail
				if ((getFeatureData & 4) == 4){
					return ERROR;
				}
			}else{
				return ERROR;
			}
    	}
    }else{
    	return ERROR;
    }

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Erase block
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  blockNum: The number of block(first block is zero)
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Blk128_Erase(Nand_Flash_Cfg_Type *flashCfg, uint32_t blockNum)
{
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint32_t timeOut = 0;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

	//RA[6:15]=block
    flashCmd.cmdBuf[0] = (flashCfg->blk128EraseCmd << 24) | (blockNum << 6);
    /* rwFlag don't care */
    flashCmd.rwFlag = SF_CTRL_READ;
    flashCmd.addrSize = 3;

    SF_Ctrl_SendCmd(&flashCmd);
    timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Write enable
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Write_Enable(Nand_Flash_Cfg_Type *flashCfg)
{
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint32_t timeOut = 0;
    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    /* Write enable*/
    flashCmd.cmdBuf[0] = (flashCfg->writeEnableCmd) << 24;
    /* rwFlag don't care */
    flashCmd.rwFlag = SF_CTRL_READ;
    SF_Ctrl_SendCmd(&flashCmd);
    timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Write enable
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  absolutePageNum: The number of pages(each block has 64 pages,
 * block[0]:page[0]~page[63],block[1]:page[64]~page[127]......)
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Page_Read_To_Cache(Nand_Flash_Cfg_Type *flashCfg, uint32_t absolutePageNum)
{
    uint32_t blockNum = 0, pageNum = 0, address = 0;
    uint8_t cmd;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint32_t timeOut = 0;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    blockNum = absolutePageNum / BFLB_NAND_FLASH_PAGES_PER_BLOCK;
    //each block has 64 pages
    pageNum = absolutePageNum % BFLB_NAND_FLASH_PAGES_PER_BLOCK;
    address |= pageNum;
    address |= (blockNum << 6);
    /*page read to cache*/
    cmd = flashCfg->pageReadToCacheCmd;
    flashCmd.cmdBuf[0] = (cmd << 24) | (address);
    flashCmd.addrSize = 3;
    flashCmd.rwFlag = SF_CTRL_READ;

    SF_Ctrl_SendCmd(&flashCmd);
    timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Set feature
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Set_Feature(Nand_Flash_Cfg_Type *flashCfg)
{
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint8_t cmd;
    uint32_t timeOut = 0;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    cmd = flashCfg->setFeaturesCmd;
    flashCmd.cmdBuf[0] = (cmd << 24) | (0xA0 << 16) | (0x0 << 8);
    flashCmd.rwFlag = SF_CTRL_READ;
    flashCmd.addrSize = 2;
    SF_Ctrl_SendCmd(&flashCmd);
    timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Get feature
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Get_Feature(Nand_Flash_Cfg_Type *flashCfg, uint8_t *data, uint8_t cmdType)
{
    uint8_t * const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint8_t cmd;
    uint32_t timeOut = 0;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    cmd = flashCfg->getFeaturesCmd;
    flashCmd.cmdBuf[0] = (cmd << 24) | (cmdType << 16);
    flashCmd.rwFlag = SF_CTRL_READ;
    flashCmd.nbData = 1;
    flashCmd.addrSize = 1;
    SF_Ctrl_SendCmd(&flashCmd);
    timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

    BL702_MemCpy(data, flashCtrlBuf, flashCmd.nbData);
    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Read from cache
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  addr: start address to read
 * @param  data: data pointer to store read data
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Read_From_Cache(Nand_Flash_Cfg_Type *flashCfg, uint32_t addr, uint8_t *data, uint32_t len, uint8_t readType)
{
    uint8_t * const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint32_t curLen, i, columnAddr = 0, timeOut = 0 ;
    uint8_t cmd, dummyClks;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    if(SF_CTRL_NIO_MODE == flashCfg->ioMode){
		cmd = flashCfg->fastReadCmd;
		dummyClks = flashCfg->frDmyClk;
	}else if(SF_CTRL_DO_MODE == flashCfg->ioMode){
		flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
		cmd = flashCfg->fastReadDoCmd;
		dummyClks = flashCfg->frDoDmyClk;
	}else if(SF_CTRL_DIO_MODE == flashCfg->ioMode){
		flashCmd.addrMode = SF_CTRL_ADDR_2_LINES;
		flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
		cmd = flashCfg->fastReadDioCmd;
		dummyClks = flashCfg->frDioDmyClk;
	}else if(SF_CTRL_QO_MODE == flashCfg->ioMode){
		flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
		cmd = flashCfg->fastReadQoCmd;
		dummyClks=flashCfg->frQoDmyClk;
	}else if(SF_CTRL_QIO_MODE == flashCfg->ioMode){
		flashCmd.addrMode = SF_CTRL_ADDR_4_LINES;
		flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
		cmd = flashCfg->fastReadQioCmd;
		dummyClks=flashCfg->frQioDmyClk;
	}else{
		return ERROR;
	}

    if(readType == READ_DATA_FROM_CACHE){
    columnAddr = addr % BFLB_NAND_FLASH_PAGE_SIZE;
    }else if(readType == READ_SPARE_DATA_FROM_CACHE){
    	columnAddr = addr % BFLB_NAND_FLASH_PAGE_TOTAL_SIZE;
    }else{
    	return ERROR;
    }
    flashCmd.dummyClks = dummyClks;
    flashCmd.addrSize = 2;

    for(i = 0; i < len;){
        /* Prepare command */
        flashCmd.cmdBuf[0] = (cmd << 24) | (columnAddr << 8);
        curLen = len - i;
        if(curLen >= FLASH_CTRL_BUF_SIZE){
            curLen = FLASH_CTRL_BUF_SIZE;
            flashCmd.nbData = curLen;
        }else{
            /* Make sf_ctrl word read */
            flashCmd.nbData = ((curLen + 3) >> 2) << 2;
        }

