bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/StdDriver/Src/bl702_nflash.c
        SF_Ctrl_SendCmd(&flashCmd);
        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
		while(SET == SF_Ctrl_GetBusyState()){
			timeOut--;
			if(timeOut == 0){
				return TIMEOUT;
			}
		}

        BL702_MemCpy_Fast(data, flashCtrlBuf, curLen);

        i += curLen;
        data += curLen;
    }

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Program execute
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  addr: start address to program execute
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Program_Execute(Nand_Flash_Cfg_Type *flashCfg, uint32_t addr)
{
	SF_Ctrl_Cmd_Cfg_Type flashCmd;
	uint32_t blockNum = 0, pageNum = 0, address = 0;
	uint32_t timeOut = 0;

	if(((uint32_t)&flashCmd) % 4 == 0){
		BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
	}else{
		BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
	}

	blockNum = addr / BFLB_NAND_FLASH_BLK_DATA_SIZE;
	//each block has 64 pages
	pageNum = (addr / BFLB_NAND_FLASH_PAGE_SIZE) - (blockNum * 64);
	address |= pageNum;
	address |= (blockNum << 6);

	flashCmd.cmdBuf[0] = (flashCfg->pageProgramCmd << 24) | (address);
	/* rwFlag don't care */
	flashCmd.rwFlag = SF_CTRL_WRITE;
	flashCmd.addrSize = 3;

	SF_Ctrl_SendCmd(&flashCmd);
	timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

	return SUCCESS;
}

BL_Err_Type ATTR_TCM_SECTION NFlash_Check_Bad_Block(Nand_Flash_Cfg_Type *flashCfg, uint32_t blockNum, uint8_t *data, uint32_t len)
{
	uint8_t getFeatureData = 0;
	uint32_t pageNum = 0, readAddr = 0;
	uint32_t stat = 0;
	pageNum = blockNum * BFLB_NAND_FLASH_PAGES_PER_BLOCK;
	readAddr = pageNum * BFLB_NAND_FLASH_PAGE_TOTAL_SIZE + 2048;
	stat = NFlash_Page_Read_To_Cache(flashCfg, pageNum);
	stat = NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
	while ((getFeatureData & 1) == 1){
		stat = NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
	}
	stat = NFlash_Read_From_Cache(flashCfg, readAddr, data, len, 1);
	return stat;
}
/****************************************************************************//**
 * @brief  Read flash
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  startaddr: start address to read
 * @param  data: data pointer to store read data
 * @param  len: the length of read data
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Read(Nand_Flash_Cfg_Type *flashCfg, uint32_t startaddr, uint8_t *data, uint32_t len)
{
    uint8_t getFeatureData = 0;
    uint32_t startPageNum = 0, endPageNum = 0, absolutePageNum = 0;
    uint32_t readLen = 0,  readAddr = 0, beginAddr = startaddr;

    startPageNum = startaddr / BFLB_NAND_FLASH_PAGE_SIZE;
    endPageNum = (startaddr + len - 1) / BFLB_NAND_FLASH_PAGE_SIZE;
    /* Read data */
    if (len > 0){
    	for (absolutePageNum = startPageNum; absolutePageNum <= endPageNum; absolutePageNum++){
    		readAddr = startaddr;
    		if (absolutePageNum == startPageNum){
    			if (beginAddr + len >= BFLB_NAND_FLASH_PAGE_SIZE){
    				readLen = (startPageNum + 1) * BFLB_NAND_FLASH_PAGE_SIZE - beginAddr;
    			}else{
    				readLen = len;
    			}
    		}else if ((startPageNum < absolutePageNum) && (absolutePageNum < endPageNum)){
    			readLen = BFLB_NAND_FLASH_PAGE_SIZE;
    		}else if (absolutePageNum == endPageNum){
    			readLen = (beginAddr + len) - (endPageNum * BFLB_NAND_FLASH_PAGE_SIZE);
    		}

    		NFlash_Page_Read_To_Cache(flashCfg, absolutePageNum);
			NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
			while ((getFeatureData & 1) == 1){
				NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
			}

			NFlash_Read_From_Cache(flashCfg, readAddr, data, readLen, 0);
			startaddr = (absolutePageNum + 1) * BFLB_NAND_FLASH_PAGE_SIZE;
			data += readLen;
    	}
    }else{
    	return ERROR;
    }

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Program load
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  addr: start address to program execute
 * @param  data: data pointer to program load data
 * @param  len: the length of program load data
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Program_Load(Nand_Flash_Cfg_Type *flashCfg, uint32_t addr, const uint8_t *data, uint32_t len)
{
    uint8_t * const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint8_t cmd;
    uint32_t timeOut = 0;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    if(SF_CTRL_NIO_MODE == flashCfg->ioMode || SF_CTRL_DO_MODE == flashCfg->ioMode || SF_CTRL_DIO_MODE == flashCfg->ioMode)
	{
		cmd = flashCfg->programLoadCmd;
	}else if(SF_CTRL_QIO_MODE == flashCfg->ioMode||SF_CTRL_QO_MODE==flashCfg->ioMode){
		flashCmd.addrMode = (SF_Ctrl_Addr_Mode_Type)flashCfg->qppAddrMode;
		flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
		cmd = flashCfg->qprogramLoadCmd;
	}else{
		return ERROR;
	}

    //program load
    flashCmd.addrSize = 2;
    flashCmd.rwFlag = SF_CTRL_WRITE;
	flashCmd.cmdBuf[0] = (cmd << 24) | (addr << 8);
	flashCmd.nbData = len;
	BL702_MemCpy_Fast(flashCtrlBuf, data, len);
	SF_Ctrl_SendCmd(&flashCmd);
	timeOut = SFCTRL_BUSY_STATE_TIMEOUT;
	while(SET == SF_Ctrl_GetBusyState()){
		timeOut--;
		if(timeOut == 0){
			return TIMEOUT;
		}
	}

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  Program load
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  addr: start address to program
 * @param  data: data pointer to program load data
 * @param  len: the length of program data
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION NFlash_Program(Nand_Flash_Cfg_Type *flashCfg, uint32_t addr, const uint8_t *data, uint32_t len)
{
    uint8_t getFeatureData = 0;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint32_t startPageNum = 0, endPageNum = 0, absolutePageNum = 0;
	uint32_t writeLen = 0, programLoadAddr = 0, programExecuteAddr = 0;
	uint32_t i = 0, curLen = 0, offsite = 0, begin_addr =  addr;

	startPageNum = addr / BFLB_NAND_FLASH_PAGE_SIZE;
	endPageNum = (addr + len - 1) / BFLB_NAND_FLASH_PAGE_SIZE;

    if(((uint32_t)&flashCmd) % 4 == 0){
        BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd)/4);
    }else{
        BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

