bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/StdDriver/Src/bl702_nflash.c
    if (len > 0){
		for (absolutePageNum = startPageNum; absolutePageNum <= endPageNum; absolutePageNum++){
			programExecuteAddr = addr;
			offsite = 0;
			curLen = 0;
			if (absolutePageNum == startPageNum){
				if (begin_addr + len >= BFLB_NAND_FLASH_PAGE_SIZE){
					writeLen = (startPageNum + 1) * BFLB_NAND_FLASH_PAGE_SIZE - begin_addr;
				}else{
					writeLen = len;
				}
				programLoadAddr = begin_addr % BFLB_NAND_FLASH_PAGE_SIZE;
			}else if ((startPageNum < absolutePageNum) && (absolutePageNum < endPageNum)){
				writeLen = BFLB_NAND_FLASH_PAGE_SIZE;
				programLoadAddr = 0;
			}else if (absolutePageNum == endPageNum){
				writeLen = (begin_addr + len) - (endPageNum * BFLB_NAND_FLASH_PAGE_SIZE);
				programLoadAddr = 0;
			}
			for(i = 0; i < writeLen;){
				curLen = writeLen - i;
				if(curLen >= FLASH_CTRL_BUF_SIZE){
					curLen = FLASH_CTRL_BUF_SIZE;
				}
				NFlash_Program_Load(flashCfg, programLoadAddr + offsite, data, curLen);
				NFlash_Write_Enable(flashCfg);
				NFlash_Program_Execute(flashCfg, programExecuteAddr + offsite);
				NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
				// bit[0]:operation in process
				while ((getFeatureData & 1) == 1){
					NFlash_Get_Feature(flashCfg, &getFeatureData, 0xC0);
				}
				// bit[3]:program fail
				if ((getFeatureData & 8) == 8){
					return ERROR;
				}
				i += curLen;
				data += curLen;
				offsite += curLen;
			}
			addr = (absolutePageNum + 1) * BFLB_NAND_FLASH_PAGE_SIZE;
		}
    }else{
		return ERROR;
	}

    return SUCCESS;
}
